#include <stdint.h>

#define RCC_EN *(uint32_t *)(0x40023800UL + 0x30UL) |= 0x02UL + 0x04UL;


int main(void)
{
    RCC_EN;
    *(uint32_t *)(0x40023800UL + 0x30UL) |= 0x02UL + 0x04UL; // Включение тактирования для переферии GPIO, регистр AHB1ENR

    *(uint32_t *)(0x40020400UL + 0x00UL) |= 0x4000UL; // Настройка редима работы порта на выход, регистр
    *(uint32_t *)(0x40020400UL + 0x04UL) &= ~0x80UL;   // Настройка режима выхода пина PB7 на push-pull, регистр
    *(uint32_t *)(0x40020400UL + 0x08UL) |= 0x4000UL; // Настройка сокрости работы порта на среднюю, регистр OSPEED

    *(uint32_t *)(0x40020400UL + 0x18UL) |= 0x800000UL; // Предаварительное отключение светодиода, регистр BSRR

    while (1)
    {
         if (*(uint32_t *)(0x40020800UL + 0x10UL) & 0x2000UL)
         {
            *(uint32_t *)(0x40020400UL + 0x18UL) |= 0x80UL; // Влючение светодиода, регистр BSRR
         }
         else
         {
             *(uint32_t *)(0x40020400UL + 0x18UL) |= 0x800000UL; // Отключение светодиода, регистр BSRR
         }
    }
}